In [5]:
import numpy as np
import pandas as pd

In [2]:
labels = ['one','two','three']

In [3]:
listi = [1,2,3]

In [4]:
arr = np.array([10,20,30])

In [5]:
d = {'a':10,'b':20,'c':30}

In [11]:
pd.Series(data = listi, index= labels)

one      1
two      2
three    3
dtype: int64

In [12]:
pd.Series(index = listi, data = labels)

1      one
2      two
3    three
dtype: object

In [13]:
pd.Series(listi,labels)

one      1
two      2
three    3
dtype: int64

In [3]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [9]:
dataf = pd.DataFrame(randn(4,5), index=' A B C D'.split(), columns='1 2 3 4 5'.split())

In [10]:
dataf

          1         2         3         4         5
A -0.993263  0.196800 -1.136645  0.000366  1.025984
B -0.156598 -0.031579  0.649826  2.154846 -0.610259
C -0.755325 -0.346419  0.147027 -0.479448  0.558769
D  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [17]:
dataf[['1']]

          1
A -0.993263
B -0.156598
C -0.755325
D  1.024810

In [18]:
dataf['new1'] = dataf['2'] + dataf['5']

In [19]:
dataf

          1         2         3         4         5      new1
A -0.993263  0.196800 -1.136645  0.000366  1.025984  1.222784
B -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838
C -0.755325 -0.346419  0.147027 -0.479448  0.558769  0.212351
D  1.024810 -0.925874  1.862864 -1.133817  0.610478 -0.315396

In [22]:
dataf.drop('new1',axis=1)

          1         2         3         4         5
A -0.993263  0.196800 -1.136645  0.000366  1.025984
B -0.156598 -0.031579  0.649826  2.154846 -0.610259
C -0.755325 -0.346419  0.147027 -0.479448  0.558769
D  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [23]:
dataf

          1         2         3         4         5      new1
A -0.993263  0.196800 -1.136645  0.000366  1.025984  1.222784
B -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838
C -0.755325 -0.346419  0.147027 -0.479448  0.558769  0.212351
D  1.024810 -0.925874  1.862864 -1.133817  0.610478 -0.315396

In [24]:
dataf.drop('new1',axis=1,inplace=True)

In [25]:
dataf

          1         2         3         4         5
A -0.993263  0.196800 -1.136645  0.000366  1.025984
B -0.156598 -0.031579  0.649826  2.154846 -0.610259
C -0.755325 -0.346419  0.147027 -0.479448  0.558769
D  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [27]:
dataf.drop('A',axis=0)

          1         2         3         4         5
B -0.156598 -0.031579  0.649826  2.154846 -0.610259
C -0.755325 -0.346419  0.147027 -0.479448  0.558769
D  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [28]:
dataf

          1         2         3         4         5
A -0.993263  0.196800 -1.136645  0.000366  1.025984
B -0.156598 -0.031579  0.649826  2.154846 -0.610259
C -0.755325 -0.346419  0.147027 -0.479448  0.558769
D  1.024810 -0.925874  1.862864 -1.133817  0.610478

selecting rows

In [29]:
dataf.loc['A']

1   -0.993263
2    0.196800
3   -1.136645
4    0.000366
5    1.025984
Name: A, dtype: float64

In [30]:
dataf.iloc[2]

1   -0.755325
2   -0.346419
3    0.147027
4   -0.479448
5    0.558769
Name: C, dtype: float64

In [32]:
dataf.loc['A','2']

0.19679950499134005

In [36]:
dataf.loc[['A','B'],['3','2']]

          3         2
A -1.136645  0.196800
B  0.649826 -0.031579

In [37]:
dataf > 0

       1      2      3      4      5
A  False   True  False   True   True
B  False  False   True   True  False
C  False  False   True  False   True
D   True  False   True  False   True

In [38]:
dataf[dataf>0]

         1       2         3         4         5
A      NaN  0.1968       NaN  0.000366  1.025984
B      NaN     NaN  0.649826  2.154846       NaN
C      NaN     NaN  0.147027       NaN  0.558769
D  1.02481     NaN  1.862864       NaN  0.610478

In [40]:
data = {'Laptop':['one','two','three','four'],
        'Company':['hp','dell','acer','asus'],
        'prise':[200,300,400,100]}

In [41]:
data

{'Laptop': ['one', 'two', 'three', 'four'],
 'Company': ['hp', 'dell', 'acer', 'asus'],
 'prise': [200, 300, 400, 100]}

In [42]:
print(data)

{'Laptop': ['one', 'two', 'three', 'four'], 'Company': ['hp', 'dell', 'acer', 'asus'], 'prise': [200, 300, 400, 100]}

In [46]:
df = pd.DataFrame(data)

In [47]:
df

  Laptop Company  prise
0    one      hp    200
1    two    dell    300
2  three    acer    400
3   four    asus    100

In [50]:
print(df.groupby('Company').mean())

         prise
Company
acer       400
asus       100
dell       300
hp         200

In [58]:
df

  Laptop Company  prise
0    one      hp    200
1    two    dell    300
2  three    acer    400
3   four    asus    100

In [52]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [53]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [54]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [55]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [56]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [57]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [60]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [62]:
pwd

'C:\\Users\\Akshay\\Music\\Learning Book'

In [65]:
df = pd.read_csv('example')

In [66]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [67]:
df.to_csv('example',index=False)

In [68]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15